/*
* Да се напише приложение,
* което приема адрес към която и да е уеб страница,
* зарежда изходния ѝ код и търси текст по зададен от потребител шаблон на регулярен израз,
* намира чрез регулярни изрази други страници и ги добавя за по-късно посещение в стек и с тях прави същото.
* Намерените текстове да се съхраняват в база данни, както и URL адресите на вече посетените и обработени уеб страници.
* Бонус точки, ако се направи асинхронно и многонишково, както и ако се публикува в git с документация за проекта.
* */